---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CircleMultiPlanarShapeInSketch
source: html/ddaabb60-18e0-0fe2-4d73-7f8ac03b9368.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CircleMultiPlanarShapeInSketch Property

A circle can't be converted to multiplanar shape.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircleMultiPlanarShapeInSketch { get; }
```